Revit 2027 API
BuiltInFailures.ConversionFailures.UndefinedFluidUnit Property
 Undefined fluid unit: '[Fluid Unit Type Name]'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UndefinedFluidUnit { get; }
Public Shared ReadOnly Property UndefinedFluidUnit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UndefinedFluidUnit {
	FailureDefinitionId^ get ();
}
static member UndefinedFluidUnit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConversionFailures Class
Autodesk.Revit.DB Namespace